Revit 2018 API
BuiltInFailures.MEPCalculationFailures.NetworkErrorOverConstrained Property
 The calculation could not be performed. Verify that demand flow is specified for all required elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public static FailureDefinitionId NetworkErrorOverConstrained { get; }
Visual Basic
Public Shared ReadOnly Property NetworkErrorOverConstrained As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NetworkErrorOverConstrained {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace